Documents/ОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОказаниеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрУслуг</xr:Item>
				<xr:Item>AccumulationRegister.РегистрМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.РегистрЗаработнойПлаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мастер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаКлиента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьМинут</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериалов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОказаниеУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь выбирает или изменяет услугу
// в табличной части "Услуги".
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)

	// Получаем текущую строку табличной части "Услуги".
	Стр = Элементы.Услуги.ТекущиеДанные;
	
	// Если текущая строка не определена,
	// дальше выполнять код нельзя.
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Проверяем, выбрана ли услуга в текущей строке.
	Если ЗначениеЗаполнено(Стр.Услуга) Тогда
		
		// Получаем данные услуги на сервере.
		// Из справочника "Услуги" берутся цена и длительность.
		ДанныеУслуги = ПолучитьДанныеУслугиНаСервере(Стр.Услуга);
		
		// Заполняем стоимость услуги в строке документа.
		Стр.Стоимость = ДанныеУслуги.Цена;
		
		// Заполняем длительность услуги в минутах.
		Стр.ДлительностьМинут = ДанныеУслуги.ДлительностьМинут;
		
	Иначе
		
		// Если услуга не выбрана, стоимость обнуляется.
		Стр.Стоимость = 0;
		
		// Длительность также обнуляется.
		Стр.ДлительностьМинут = 0;
		
	КонецЕсли;

	// Если указано время начала и длительность больше нуля,
	// рассчитываем время окончания услуги.
	Если ЗначениеЗаполнено(Стр.ВремяНачала)
	И Стр.ДлительностьМинут > 0 Тогда
		
		// В 1С дата и время изменяются в секундах.
		// Поэтому длительность в минутах умножается на 60.
		Стр.ВремяОкончания = Стр.ВремяНачала + Стр.ДлительностьМинут * 60;
		
	КонецЕсли;

	// После изменения услуги пересчитываем общую сумму документа.
	ПересчитатьОбщуюСумму();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь изменяет время начала услуги.
&НаКлиенте
Процедура УслугиВремяНачалаПриИзменении(Элемент)

	// Получаем текущую строку табличной части "Услуги".
	Стр = Элементы.Услуги.ТекущиеДанные;
	
	// Если строка не выбрана, процедуру дальше выполнять нельзя.
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Если время начала заполнено и длительность услуги больше нуля,
	// рассчитываем время окончания.
	Если ЗначениеЗаполнено(Стр.ВремяНачала) И Стр.ДлительностьМинут > 0 Тогда
		
		// К времени начала прибавляем длительность услуги в секундах.
		Стр.ВремяОкончания = Стр.ВремяНачала + Стр.ДлительностьМинут * 60;
		
	КонецЕсли;

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь выбирает или изменяет материал
// в табличной части "Материалы".
&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)

	// После выбора материала нужно пересчитать строку:
	// получить цену материала, рассчитать стоимость
	// и обновить общую сумму документа.
	ПересчитатьСтрокуМатериалов();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь изменяет количество материала.
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)

	// Получаем текущую строку табличной части "Материалы".
	Стр = Элементы.Материалы.ТекущиеДанные;
	
	// Если строка не выбрана, прекращаем выполнение процедуры.
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Рассчитываем стоимость материала:
	// количество умножается на цену.
	Стр.Стоимость = Стр.Количество * Стр.Цена;
	
	// После изменения стоимости пересчитываем общую сумму документа.
	ПересчитатьОбщуюСумму();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь вручную изменяет цену материала.
&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)

	// Получаем текущую строку табличной части "Материалы".
	Стр = Элементы.Материалы.ТекущиеДанные;
	
	// Если текущей строки нет, дальше выполнять код нельзя.
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Пересчитываем стоимость строки:
	// количество материала умножается на цену.
	Стр.Стоимость = Стр.Количество * Стр.Цена;
	
	// Обновляем общую сумму документа.
	ПересчитатьОбщуюСумму();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает при изменении процента скидки.
&НаКлиенте
Процедура СкидкаПроцентПриИзменении(Элемент)

	// После изменения скидки нужно заново рассчитать общую сумму документа.
	ПересчитатьОбщуюСумму();

КонецПроцедуры


// Процедура пересчитывает текущую строку табличной части "Материалы".
// Она получает цену материала из регистра сведений,
// рассчитывает стоимость строки и обновляет итоговую сумму документа.
&НаКлиенте
Процедура ПересчитатьСтрокуМатериалов()

	// Получаем текущую строку табличной части "Материалы".
	Стр = Элементы.Материалы.ТекущиеДанные;
	
	// Если строка не выбрана, пересчитывать нечего.
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Проверяем, заполнен ли материал.
	Если ЗначениеЗаполнено(Стр.Материал) Тогда
		
		// Получаем цену материала на дату документа.
		Стр.Цена = ПолучитьЦенуМатериала(
			Стр.Материал,
			Объект.Дата);
			
	Иначе
		
		// Если материал не выбран, цену определить нельзя.
		Стр.Цена = 0;
		
	КонецЕсли;

	// Рассчитываем стоимость строки:
	// количество материала умножается на цену.
	Стр.Стоимость = Стр.Количество * Стр.Цена;
	
	// После пересчета строки обновляем общую сумму документа.
	ПересчитатьОбщуюСумму();

КонецПроцедуры


// Процедура пересчитывает общую сумму документа.
// В данном документе общая сумма считается только по услугам.
// Материалы в сумму оплаты клиента не включаются,
// они нужны для учета себестоимости и списания со склада.
&НаКлиенте
Процедура ПересчитатьОбщуюСумму()

	// Переменная для накопления суммы всех услуг.
	СуммаУслуг = 0;

	// Перебираем все строки табличной части "Услуги".
	Для Каждого СтрУслуга Из Объект.Услуги Цикл
		
		// Добавляем стоимость текущей услуги к общей сумме услуг.
		СуммаУслуг = СуммаУслуг + СтрУслуга.Стоимость;
		
	КонецЦикла;

	// Записываем сумму услуг в реквизит документа "ОбщаяСумма".
	Объект.ОбщаяСумма = СуммаУслуг;

	// Если указан процент скидки, уменьшаем общую сумму.
	Если Объект.СкидкаПроцент > 0 Тогда
		
		// Например, если скидка 10%, клиент оплачивает 90% от суммы.
		Объект.ОбщаяСумма =
		Объект.ОбщаяСумма *
		(100 - Объект.СкидкаПроцент) / 100;
		
	КонецЕсли;

КонецПроцедуры


// Функция выполняется на сервере без контекста формы.
// Она получает цену материала из регистра сведений "ЦеныМатериалов"
// на указанную дату.
&НаСервереБезКонтекста
Функция ПолучитьЦенуМатериала(Материал, ДатаДок)

	// Проверяем, выбран ли материал.
	// Если материал не указан, цену найти невозможно.
	Если Не ЗначениеЗаполнено(Материал) Тогда
		Возврат 0;
	КонецЕсли;

	// Создаем новый запрос к базе данных.
	Запрос = Новый Запрос;
	
	// В запросе используется виртуальная таблица СрезПоследних
	// регистра сведений "ЦеныМатериалов".
	// Она возвращает последнюю актуальную цену материала на указанную дату.
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныМатериаловСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|		&Дата,
	|		Материал = &Материал
	|	) КАК ЦеныМатериаловСрезПоследних";

	// Передаем дату, на которую нужно получить цену.
	// КонецДня используется, чтобы цена искалась на конец даты документа.
	Запрос.УстановитьПараметр("Дата", КонецДня(ДатаДок));
	
	// Передаем материал, по которому ищется цена.
	Запрос.УстановитьПараметр("Материал", Материал);

	// Выполняем запрос.
	Результат = Запрос.Выполнить();

	// Проверяем, есть ли результат запроса.
	Если Не Результат.Пустой() Тогда
		
		// Получаем выборку результата.
		Выборка = Результат.Выбрать();
		
		// Переходим к первой строке результата.
		Если Выборка.Следующий() Тогда
			
			// Возвращаем найденную цену материала.
			Возврат Выборка.Цена;
			
		КонецЕсли;
		
	КонецЕсли;

	// Если цена не найдена, возвращаем 0.
	Возврат 0;

КонецФункции                           


// Функция выполняется на сервере без контекста формы.
// Она получает данные услуги из справочника "Услуги":
// цену и длительность в минутах.
&НаСервереБезКонтекста
Функция ПолучитьДанныеУслугиНаСервере(СсылкаНаУслугу)

	// Создаем структуру результата.
	// По умолчанию цена и длительность равны 0.
	Результат = Новый Структура("Цена, ДлительностьМинут", 0, 0);

	// Проверяем, передана ли ссылка на услугу.
	// Если услуга не выбрана, возвращаем пустую структуру.
	Если Не ЗначениеЗаполнено(СсылкаНаУслугу) Тогда
		Возврат Результат;
	КонецЕсли;

	// Получаем объект справочника "Услуги" по ссылке.
	ОбъектУслуги = СсылкаНаУслугу.ПолучитьОбъект();
	
	// Записываем цену услуги в структуру результата.
	Результат.Цена = ОбъектУслуги.Цена;
	
	// Записываем длительность услуги в минутах.
	Результат.ДлительностьМинут = ОбъектУслуги.ДлительностьМинут;

	// Возвращаем данные услуги обратно на клиент.
	Возврат Результат;

КонецФункции
